#include <iostream>
using namespace std;

void showInfoAboutLeftRectangles() {
	wcout << "Теоретичні відомості" << "\n" << endl;
	wcout << "Метод лівих прямокутників - метод чисельного інтегрування функції однієї змінної, що полягає в заміні підінтегральної функції на многочлен нульового степіня, тобто константу, на кожному елементарному відрізку. Якщо розглянути графік підінтегральної функції, то метод буде полягати в наближеному обчисленні суми площ кінцевого числа прямокутників, ширина яких буде визначатися відстанню між відповідними сусідніми вузлами інтегрування, а висота - значенням підінтегральної функції в цих вузлах." << endl;
	wcout << "Алгебраїчний порядок точності: 0." << "\n" << endl;
	wcout << "Формула для розрахунку: " << endl;
	wcout << "b        n-1" << "\n" << L"\u222bf(x)dx \u2248 " << L"\u2211f(x\u2081) * (x\u2082 - x\u2081)" << ", де" << "\n" << "a        i=0" << "" << endl;
	wcout << "   " << "a, b - межі інтегрування," << endl;
	wcout << "   " << "n - кількість часткових інтервалів," << endl;
	wcout << "   " << "h = b - a / n" << endl;
	wcout << "   " << L"x\u2081 = a + i * h,"  << endl;
	wcout << "   " << L"x\u2082 = a + (i + 1) * h," <<  endl;
	return;
}

void showInfoAboutRightRectangles() {
	wcout << "Теоретичні відомості" << "\n" << endl;
	wcout << "Метод правих прямокутників - метод чисельного інтегрування функції однієї змінної, що полягає в заміні підінтегральної функції на многочлен нульового степіня, тобто константу, на кожному елементарному відрізку. Якщо розглянути графік підінтегральної функції, то метод буде полягати в наближеному обчисленні суми площ кінцевого числа прямокутників, ширина яких буде визначатися відстанню між відповідними сусідніми вузлами інтегрування, а висота - значенням підінтегральної функції в цих вузлах." << endl;
	wcout << "Алгебраїчний порядок точності: 0." << "\n" << endl;
	wcout << "Формула для розрахунку: " << endl;
	wcout << "b         n" << "\n" << L"\u222bf(x)dx \u2248 " << L"\u2211f(x\u2082) * (x\u2082 - x\u2081)" << ", де" << "\n" << "a        i=1" << "" << endl;
	wcout << "   " << "a, b - межі інтегрування," << endl;
	wcout << "   " << "n - кількість часткових інтервалів," << endl;
	wcout << "   " << "h = b - a / n" << endl;
	wcout << "   " << L"x\u2081 = a + (i - 1) * h,"  << endl;
	wcout << "   " << L"x\u2082 = a + i * h," <<  endl;
	return;
}

void showInfoAboutAverageRectangles() {
	wcout << "Теоретичні відомості" << "\n" << endl;
	wcout << "Метод середніх прямокутників - метод чисельного інтегрування функції однієї змінної, що полягає в заміні підінтегральної функції на многочлен нульового степіня, тобто константу, на кожному елементарному відрізку. Якщо розглянути графік підінтегральної функції, то метод буде полягати в наближеному обчисленні суми площ кінцевого числа прямокутників, ширина яких буде визначатися відстанню між відповідними сусідніми вузлами інтегрування, а висота - значенням підінтегральної функції в цих вузлах." << endl;
	wcout << "Алгебраїчний порядок точності: 1." << "\n" << endl;
	wcout << "Формула для розрахунку: " << endl;
	wcout << "b         n" << "\n" << L"\u222bf(x)dx \u2248 " << L"\u2211f((x\u2082 + x\u2081) / 2) * (x\u2082 - x\u2081)" << ", де" << "\n" << "a        i=1" << "" << endl;
	wcout << "   " << "a, b - межі інтегрування," << endl;
	wcout << "   " << "n - кількість часткових інтервалів," << endl;
	wcout << "   " << "h = b - a / n" << endl;
	wcout << "   " << L"x\u2081 = a + (i - 1) * h,"  << endl;
	wcout << "   " << L"x\u2082 = a + i * h," <<  endl;
	return;
}

void showInfoAboutTrapezes() {
	wcout << "Теоретичні відомості" << "\n" << endl;
	wcout << "Метод трапецій - метод чисельного інтегрування функції однієї змінної, що полягає в заміні підінтегральної функції на многочлен першого степіня, тобто лінійну функцію, на кожному елементарному відрізку. Якщо розглянути графік підінтегральної функції, то метод буде полягати в наближеному обчисленні суми площ кінцевого числа прямокутних трапецій." << endl;
	wcout << "Алгебраїчний порядок точності: 1." << "\n" << endl;
	wcout << "Формула для розрахунку: " << endl;
	wcout << "b        n-1" << "\n" << L"\u222bf(x)dx \u2248 " << L"\u2211((f(x\u2082) + f(x\u2081)) / 2) * (x\u2082 - x\u2081)" << ", де" << "\n" << "a        i=0" << "" << endl;
	wcout << "   " << "a, b - межі інтегрування," << endl;
	wcout << "   " << "n - кількість часткових інтервалів," << endl;
	wcout << "   " << "h = b - a / n" << endl;
	wcout << "   " << L"x\u2081 = a + i  * h,"  << endl;
	wcout << "   " << L"x\u2082 = a + (i + 1) * h," <<  endl;
	return;
}

void showInfoAboutParabolas() {
	wcout << "Теоретичні відомості" << "\n" << endl;
	wcout << "Метод парабол(Сімпсона) - метод чисельного інтегрування функції однієї змінної, що полягає в заміні підінтегральної функції на інтерполяційний многочлен другого степіня, тобто приближення графіка функції на кожному інтервалі до параболи. Якщо розглянути графік підінтегральної функції, то метод буде полягати в наближеному обчисленні суми площ кінцевого числа парабол." << endl;
	wcout << "Алгебраїчний порядок точності: 3." << "\n" << endl;
	wcout << "Формула для розрахунку: " << endl;
	wcout << "b                  N-1" << "\n" << L"\u222bf(x)dx \u2248 " << L"(h / 3) * \u2211(f(x\u2081) + 4 * f(x\u2082) + f(x\u2083))" << ", де" << "\n" << "a                  k=1" << "" << endl;
	wcout << "   " << "a, b - межі інтегрування," << endl;
	wcout << "   " << "N = 2 * n - кількість часткових інтервалів," << endl;
	wcout << "   " << "k = 1, 3, 5, 7, 9,..." << endl;
	wcout << "   " << "h = b - a / n" << endl;
	wcout << "   " << L"x\u2081 = a + (i - 1)  * h,"  << endl;
	wcout << "   " << L"x\u2082 = a + i * h," <<  endl;
	wcout << "   " << L"x\u2082 = a + (i + 1) * h," <<  endl;
	return;
}

void showInfoAboutProgramme() {
	wcout << "Програма призначена для обчислення визначеного інтеграла від функції з однією змінною." << endl;
	wcout << "Передбачено вибір розв'язку 5 способами:" << endl;
	wcout << "  - методом лівих прямокутників;" << endl;
	wcout << "  - методом правих прямокутників;" << endl;
	wcout << "  - методомсередніх прямокутників;" << endl;
	wcout << "  - методом трапецій;" << endl;
	wcout << "  - методом парабол." << endl;
	return;
}

void showInfoAboutAuthor() {
	wcout << "Проект виконав:" << endl;
	wcout << "Студент 1-го курсу НТУУ «Київський політехнічний інститут імені Ігоря Сікорського», факультету «Інститут системного прикладного аналізу», спеціальності «Системний аналіз», групи КА-04, Михайленко Богдан" << endl;
	return;
}

void showHelpInfo() {
	wcout << "1.Вибір команд:" << endl;
	wcout << "  - лише цифри у відповідності до певної команди." << "\n" << endl;
	wcout << "2.Підінтегральна функція:" << endl;
	wcout << "  - підтримуються дійсні числа;" << endl;
	wcout << "  - підтримуються стандратні  дужки: (, );" << endl; 
	wcout << "  - підтримуються стандартні математичні операції: +, -, *, /, ^;" << endl; 
	wcout << "  - підтримуються стандартні математичні функції: ln(), lg(), exp();" << endl;
	wcout << "  - підтримуються стандартні тригонометричні функції: sin(), cos(), tg(), ctg(), arcsin(), arccos(), arctg(), arcctg(), sh(), ch(), th(), cth();" << endl; 
	wcout << "  - необхідно строге дотримання коректності введення математичних виразів(використання дужок, правильний порядок операндів і т.д.)." << "\n" << endl; 
	wcout << "3.Верхня(b) та нижня(a) межі інтегрування:" << endl;	
	wcout << "  - дійсні числа;" << endl;
	wcout << "  - b завжди більше ніж a." << "\n"  << endl;
	wcout << "4.Кількість часткових інтервалів(n):" << endl;	
	wcout << "  - натуральні числа;" << endl;
	wcout << "  - збільшення n покращує точність отриманих результатів;" << endl;
	wcout << "  - рекомендується не вводити значення більші за 250000 через довгий час виконання програми." << endl;
	return;
}
